higher-order-unification.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="english" xml:lang="english">
<head>
<!-- 2024-09-16 Mon 22:57 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>An explanation of higher order unification</title>
<meta name="author" content="Justin Veilleux" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="Agda.css" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">An explanation of higher order unification</h1>
<p>
I'm interested in programming languages with <a href="https://en.wikipedia.org/wiki/Dependent_type">dependent types</a> such as <a href="https://agda.readthedocs.io/en/v2.6.4.3/getting-started/what-is-agda.html">Agda</a>. To
make such a language more ergonomic and easier to use, we need a good type
inference algorithm.
</p>

<div id="outline-container-orgd7b6ffd" class="outline-2">
<h2 id="orgd7b6ffd"><span class="section-number-2">1.</span> What dependent types are</h2>
<div class="outline-text-2" id="text-1">
<p>
For those who don't know, a dependent type system is a type system inwhich a
type can depend on a value. For instance, in Haskell, a value can depend
(contain a reference to) on a value like this:
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #8f0075;">f</span> x <span style="color: #3548cf;">=</span> x <span style="color: #3548cf;">+</span> 1
</pre>
</div>

<p>
Here, the body of <code>f</code> contains a reference to <code>x</code>.
</p>

<p>
In Haskell, types can depend on other types:
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #005e8b; font-weight: bold;">data</span> <span style="color: #531ab6; font-weight: bold;">Tree</span> a <span style="color: #3548cf;">=</span> <span style="color: #531ab6; font-weight: bold;">Leaf</span> a <span style="color: #3548cf;">|</span> <span style="color: #531ab6; font-weight: bold;">Node</span> (<span style="color: #531ab6; font-weight: bold;">Tree</span> a) (<span style="color: #531ab6; font-weight: bold;">Tree</span> a)
</pre>
</div>

<p>
Here, <code class="src src-haskell"><span style="color: #531ab6; font-weight: bold;">Tree</span> a</code> is a type containing a reference to an other type <code class="src src-haskell">a</code>.
</p>

<p>
In Haskell, values can also depend on types. We see this in polymorphic
functions (and typeclasses), but it is hidden from us through implicit type
arguments.
</p>

<p>
What dependent types get us is types with term variables. For instance, we could
define a "function" <code class="src src-haskell">isEven</code> like so:
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #8f0075;">isEven</span> <span style="color: #3548cf;">::</span> <span style="color: #531ab6; font-weight: bold;">Int</span> <span style="color: #3548cf;">-&gt;</span> <span style="color: #531ab6; font-weight: bold;">Type</span>
<span style="color: #8f0075;">isEven</span> x <span style="color: #3548cf;">=</span> <span style="color: #005e8b; font-weight: bold;">if</span> x <span style="color: #3548cf;">%</span> 2 <span style="color: #3548cf;">==</span> 0
           <span style="color: #005e8b; font-weight: bold;">then</span> <span style="color: #531ab6; font-weight: bold;">()</span>
           <span style="color: #005e8b; font-weight: bold;">else</span> <span style="color: #531ab6; font-weight: bold;">Null</span>
</pre>
</div>

<p>
Have you ever heard the phrase "propositions as types"? This is what it is.
<code class="src src-haskell"><span style="color: #8f0075;">isEven</span> x</code> is a type and it can be inhabited by a term if and only if
the number <code class="src src-haskell">x</code> is even. Someone writing a function can use this as
one of the arguments to force the user of the function to prove that
<code class="src src-haskell">x</code> is even.
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #8f0075;">thing</span> <span style="color: #3548cf;">::</span> (x <span style="color: #531ab6; font-weight: bold;">:</span> <span style="color: #531ab6; font-weight: bold;">Int</span>) <span style="color: #3548cf;">-&gt;</span> isEven x <span style="color: #3548cf;">-&gt;</span> <span style="color: #3548cf;">...</span>
<span style="color: #8f0075;">thing</span> x <span style="color: #531ab6; font-weight: bold;">()</span> <span style="color: #3548cf;">=</span> <span style="color: #3548cf;">...</span>
</pre>
</div>

<p>
Having dependent types lets us use the type system to verify proofs. Programming
languages with these are sometimes called proof assistants. See <a href="https://coq.inria.fr/">Coq</a>, <a href="https://lean-lang.org/">Lean</a>, <a href="https://agda.readthedocs.io/en/v2.6.4.3/index.html">Agda</a>
and more.
</p>
</div>
</div>

<div id="outline-container-orge188967" class="outline-2">
<h2 id="orge188967"><span class="section-number-2">2.</span> Higher order unification</h2>
<div class="outline-text-2" id="text-2">
<p>
A popular algorithm for type inference is bidirectional type checking. In this
algorithm, one part of syntax constructors "inherit" a type: they are checked
against the type the system expects them to have. The other half synthesize a
type: the algorithm guesses their types. We can see that, in this algorithm,
typing information can flow in two directions. This is why it's called
"bidirectional".
</p>

<p>
Another algorithm for type inference is called higher order unification. In a
variant of this algorithm(see <a href="#citeproc_bib_item_1">[1]</a>), we generate a bunch of
metavariables and a bunch of constraints on terms. For instance, when checking
the following term:
</p>

<p>
\[ f(a) : t \]
</p>

<p>
We generate the following constraints:
</p>

<p>
\[ \text{typeof}(f) = \prod_{v : X} T(v) \]
</p>

<p>
\[ T(a) = t \]
</p>

<p>
\[ \text{typeof}(a) = X \]
</p>

<p>
Note: throughout this text, I use uppercase letters to denote <i>metavariables</i>.
Whereas variables stand in (during the execution) for a <i>value</i>, metavariables
stand in (during the typechecking phase) for a piece of syntax that we don't
know yet. I suppose I would need a way to denote metametavariables (that stand
in for an unknown piece of syntax in the context of this text), but the absence
of such a notation doesn't hinder readibility.
</p>

<p>
Higher order unification is an algorithm that tries to find, for each
metavariable, a piece of syntax that will satisfy the equations. It is called
<i>higher order</i> (as opposed to first order), because the algorithm must consider
that terms are subject to reduction rules. For instance, in the following
unification problem:
</p>

<p>
\[ X a = a \]
</p>

<p>
\[ X b = b \]
</p>

<p>
We would have to replace \( X \) by \( \lambda_x. x \) so that \( (\lambda_x.x)a \leadsto a
\) and \( (\lambda_x.x)b \leadsto b \). Note that this procedure is generally
undecidable: one could accidentally generate a constraint whose solution is the
solution to the halting problem on some given program.
</p>
</div>
</div>

<div id="outline-container-orgd7dba12" class="outline-2">
<h2 id="orgd7dba12"><span class="section-number-2">3.</span> Huet's algorithm</h2>
<div class="outline-text-2" id="text-3">
<p>
The algorithm that is usually used for HOU is Huet's algorithm. It consists of
tree procedures
</p>

<ol class="org-ol">
<li><b>Simplification</b> is used on a set of constraints. It first reduces every term,
then it decomposes (as much as possible) rigid-rigid constraints(we will see
what those are).</li>
<li>For each flex-rigid pair, two kinds of substitutions are attempted: <b>imitation</b>
and <b>projection</b>.</li>
</ol>

<p>
I say "attempted" here because a substitution might fail whereas another would
have succeded. Therefore, we must (say, with the list monad) explore the tree of
all possible substitutions by applying simplification, then one substitution,
then simplification again until we have exhausted the tree or until we have no
more flex rigid equations.
</p>
</div>
</div>

<div id="outline-container-orged7c46a" class="outline-2">
<h2 id="orged7c46a"><span class="section-number-2">4.</span> Simplification</h2>
<div class="outline-text-2" id="text-4">
<p>
Simplification works on equalities of <b>reduced</b> terms and has multiple purposes:
</p>

<ol class="org-ol">
<li>It eliminates equalities that are solved.</li>
<li>It puts each equality in some sort of "canonical form" which will be
necessary for the later phases.</li>
</ol>

<p>
Simplification will run until it signals an error (an equation was unsolvable)
or every equation is completly simplified. It might never halt, because some
terms might have no normal form (think the Y combinator and friends).
</p>

<p>
Here's how one step works. Let's say we have the following equality:
</p>

<p>
\[ (A, B) = (C, D) \]
</p>

<p>
We can decompose it into a set of two equalities:
</p>

<p>
\[ \left\{ A = C, B = D \right\} \]
</p>

<p>
Here, our \( (A,B) = (C,D) \) constraint was what we call a rigid-rigid pair.
When we encounter such a pair, we can either decompose it into a set of smaller
equalities or signal failure.
</p>

<p>
For instance, If we have following equality:
</p>

<p>
\[ (A, B) = \lambda_T.U \]
</p>

<p>
then we know we are unable to generate a substitution for \( A, B, U \) that
satisfies the equality, so we signal failure. In the algorithm, this would cause
us to backtrack in the search tree and try another substitution.
</p>

<p>
other rigid-rigid pairs include:
</p>


<ul class="org-ul">
<li><p>
function applications where the function is not a metavariable:
</p>

<p>
\[ f(A) = g(B) \leadsto \left\{ f = g, A = B \right\} \]
</p></li>

<li><p>
lambda abstractions:
</p>

<p>
\[ \lambda_{x : t_1}.b(x) = \lambda_{y : t_2}.c(y) \leadsto \left\{ t_1 = t_2, b(z) = c(z)
  \right\} \]
</p>

<p>
Where \( z \) is a generated variable. (if one used DeBruijn indices, this
kind of &alpha;-conversion is unnecessary).
</p></li>

<li>Pi types (same as lambda abstractions)</li>

<li>References: if two references don't refer to the same variable, they are not
the same.</li>

<li>Other primitives such as numbers, strings (if your language has those), and
more.</li>
</ul>
</div>
</div>

<div id="outline-container-org5d0bb03" class="outline-2">
<h2 id="org5d0bb03"><span class="section-number-2">5.</span> Substitutions</h2>
<div class="outline-text-2" id="text-5">
<p>
When our simplification has halted, we are left with only flex-rigid and
flex-flex pairs. We don't concern ourselves with flex-flex pairs, as those are
constraints with possibly infinite solutions.
</p>

<p>
A rigid term has the shape we saw earlier.
</p>

<p>
A flex term has the following shape:
</p>

<p>
\[ M(a_1, \dots, a_k) \]
</p>

<p>
It consists an application with a metavariable as the function.
</p>

<p>
This means a flex rigid equality has the following shape:
</p>

<p>
\[ M(a_1,\dots,a_k) = f(b_1, \dots, b_l) \]
</p>

<p>
In this situation, we can try two types of substitutions on \( M \).
</p>
</div>

<div id="outline-container-orgebabcb8" class="outline-3">
<h3 id="orgebabcb8"><span class="section-number-3">5.1.</span> Imitation</h3>
<div class="outline-text-3" id="text-5-1">
<p>
Here, we "mimic" the right hand side of the equation by copying the \( f \).
</p>

<p>
\[ M \Rightarrow \lambda_{a_1 : A_1} \cdots \lambda_{a_k : A_k}. f(X_1(a_1, \dots, a_k), \dots, X_l(a_1, \dots, a_k)) \]
</p>

<p>
We reuse every argument that was given to the \( M \) function, but leave it to
a future iteration to find how. This is why we generate fresh metavariables \(
X_i \) for each argument we see \( f \) is supposed to take.
</p>

<p>
When this substitution is applied, we get the following constraint:
</p>


<p>
\[ (\lambda_{a_1 : A_1} \cdots \lambda_{a_k : A_k}. f(X_1(a_1, \dots, a_k), \dots, X_l(a_1, \dots,
a_k)))(a_1, \dots, a_k) = f(b_1, \dots, b_l) \]
</p>

<p>
Which simplifies (by reduction of the terms) to:
</p>

<p>
\[ f(X_1(a_1, \dots, a_k), \dots, X_l(a_1, \dots, a_k)) = f(b_1, \dots, b_l) \]
</p>

<p>
Which further simplifies (this is a rigid-rigid pair) to the following set of
constraints:
</p>

<p>
\[ \left\{ X_1(a_1, \dots, a_k) = b_1, \dots, X_l(a_1, \dots, a_k) = b_l \right\} \]
</p>

<p>
One such "imitation" substitution can be generated for a given equality.
</p>
</div>
</div>

<div id="outline-container-org3c6bc4f" class="outline-3">
<h3 id="org3c6bc4f"><span class="section-number-3">5.2.</span> Projection</h3>
<div class="outline-text-3" id="text-5-2">
<p>
Let's go back to our flex-rigid pair
</p>

<p>
\[ M(a_1,\dots,a_k) = f(b_1, \dots, b_l) \]
</p>

<p>
Another substitution we could have tried is:
</p>

<p>
\[ M \Rightarrow \lambda_{a_1 : A_1} \cdots \lambda_{a_k : A_k}. a_1 \]
</p>

<p>
or even
</p>

<p>
\[ M \Rightarrow \lambda_{a_1 : A_1} \cdots \lambda_{a_k : A_k}. a_2 \]
</p>

<p>
This substitution is called "projection" because it generates a function that
simply returns one of its arguments.
</p>

<p>
If The "flex" part of the flex rigid constraint has \( k \) arguments, then we
can generate \( k \) different projection substitutions.
</p>
</div>
</div>
</div>

<div id="outline-container-orgcd3d835" class="outline-2">
<h2 id="orgcd3d835"><span class="section-number-2">6.</span> Tying it all together</h2>
<div class="outline-text-2" id="text-6">
<p>
Some pseudocode for this algorithm would be:
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #8f0075;">hou</span> <span style="color: #3548cf;">::</span> [<span style="color: #531ab6; font-weight: bold;">Substitutions</span>] <span style="color: #3548cf;">-&gt;</span> [(<span style="color: #531ab6; font-weight: bold;">Term</span>, <span style="color: #531ab6; font-weight: bold;">Term</span>)] <span style="color: #3548cf;">-&gt;</span> [<span style="color: #531ab6; font-weight: bold;">Substitution</span>]
<span style="color: #8f0075;">hou</span> subs cs <span style="color: #3548cf;">=</span> <span style="color: #005e8b; font-weight: bold;">do</span>
  <span style="color: #595959; font-style: italic;">-- </span><span style="color: #595959; font-style: italic;">This part could fail</span>
  simplified <span style="color: #3548cf;">&lt;-</span> simplifyConstraints (subInConstraints subs cs)
  <span style="color: #005e8b; font-weight: bold;">let</span> flexRigids, flexFlexes <span style="color: #3548cf;">=</span> separate flexrigidp simplified
  <span style="color: #005e8b; font-weight: bold;">if</span> length fr <span style="color: #3548cf;">==</span> 0
    <span style="color: #005e8b; font-weight: bold;">then</span> return subs
    <span style="color: #005e8b; font-weight: bold;">else</span>
    <span style="color: #005e8b; font-weight: bold;">let</span> fr <span style="color: #3548cf;">=</span> flexRigids <span style="color: #3548cf;">!!</span> 0
    oneSub <span style="color: #3548cf;">&lt;-</span> generateImitation fr <span style="color: #3548cf;">::</span> generateProjections fr
    hou (oneSub <span style="color: #3548cf;">::</span> subs) cs
</pre>
</div>


<p>
Then, it would suffice to call <code class="src src-haskell"><span style="color: #8f0075;">subInTerm</span> subs term</code> to get back a
term with all the holes filled-in!
</p>
</div>
</div>

<div id="outline-container-org5072d30" class="outline-2">
<h2 id="org5072d30"><span class="section-number-2">7.</span> References</h2>
<div class="outline-text-2" id="text-7">
<style>.csl-left-margin{float: left; padding-right: 0em;}
 .csl-right-inline{margin: 0 0 0 1em;}</style><div class="csl-bib-body">
  <div class="csl-entry"><a id="citeproc_bib_item_1"></a>
    <div class="csl-left-margin">[1]</div><div class="csl-right-inline">F. Mazzoli and A. Abel, “Type checking through unification,” <i>Preprint</i>, Sep. 2016, doi: <a href="https://doi.org/10.48550/arXiv.1609.09709">10.48550/arXiv.1609.09709</a>.</div>
  </div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2024-04-02 Tue 00:00</p>
<p class="author">Author: Justin Veilleux</p>
<p class="date">Created: 2024-09-16 Mon 22:57</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
